## Staging: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 1 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ last_modified                  = "2022-03-02T17:18:51.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:63",
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:71",
        ] -> (known after apply)
      ~ source_code_hash               = "mLpIf87bvKkrP1HvNTu4mEnUOomDXDkii5DVtNC69KI=" -> "e+KMWVVOK/ovMGkXJi+lR/HmJjAVkjckTsTFpqoDWXM="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (23 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.reliability_lib must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:63" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-03-02T17:18:39.571+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:63" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "iOTOSy8Cqjvrki02rdSqe2RXzUZV8h5n9VjhzuVKOMc=" -> "ft9F/SFU3sFJD9jFGUn1yd49o5R5KfV2bJQ22KKjFYU=" # forces replacement
      ~ source_code_size            = 6212 -> (known after apply)
      ~ version                     = "63" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.reliability_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:71" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-03-02T17:18:37.490+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:71" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "8O0uD55XIOGotS45z11q8gLU/ccdu+tI4/aFqwz9luc=" -> "kMrVGPi0RCDki9BH/cJnnllciiLHvi5K1AwKDH1p1BM=" # forces replacement
      ~ source_code_size            = 4814144 -> (known after apply)
      ~ version                     = "71" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
